In [68]:
import numpy as py
from IPython.display import display
import pandas as pd

In [69]:
df = pd.DataFrame({'A': [None, 2, 3, None, 5], 'B': [10, None, None, 40, 50], 'C': [100, None, 300, 400, None]})
df

     A     B      C
0  NaN  10.0  100.0
1  2.0   NaN    NaN
2  3.0   NaN  300.0
3  NaN  40.0  400.0
4  5.0  50.0    NaN

In [70]:
# 1. 
df.dropna(thresh=len(df.columns))

Empty DataFrame
Columns: [A, B, C]
Index: []

In [71]:
# 2. 
df.dropna(thresh=1)

     A     B      C
0  NaN  10.0  100.0
1  2.0   NaN    NaN
2  3.0   NaN  300.0
3  NaN  40.0  400.0
4  5.0  50.0    NaN

In [72]:
# 3. 
df.dropna(thresh=len(df.columns) - 1, subset=['A', 'C'])

     A   B      C
2  3.0 NaN  300.0

In [73]:
# 4. 
df.fillna('Changed')

         A        B        C
0  Changed     10.0    100.0
1      2.0  Changed  Changed
2      3.0  Changed    300.0
3  Changed     40.0    400.0
4      5.0     50.0  Changed

In [74]:
# 5. 
df[['B']].fillna(value=df['B'].mean())

           B
0  10.000000
1  33.333333
2  33.333333
3  40.000000
4  50.000000